benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-cal-36920.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.46ms  666.42us   5.92ms   67.23%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    1.87ms
 90.000%    2.41ms
 99.000%    3.19ms
 99.900%    3.80ms
 99.990%    4.51ms
 99.999%    5.42ms
100.000%    5.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.042     0.000000            1         1.00
       0.645     0.100000        36407         1.11
       0.885     0.200000        72811         1.25
       1.063     0.300000       109004         1.43
       1.228     0.400000       145467         1.67
       1.387     0.500000       181796         2.00
       1.467     0.550000       200025         2.22
       1.553     0.600000       218125         2.50
       1.647     0.650000       236278         2.86
       1.751     0.700000       254466         3.33
       1.870     0.750000       272560         4.00
       1.941     0.775000       281659         4.44
       2.021     0.800000       290761         5.00
       2.109     0.825000       299973         5.71
       2.199     0.850000       308892         6.67
       2.295     0.875000       317987         8.00
       2.349     0.887500       322577         8.89
       2.407     0.900000       327070        10.00
       2.471     0.912500       331666        11.43
       2.539     0.925000       336213        13.33
       2.615     0.937500       340679        16.00
       2.657     0.943750       342995        17.78
       2.701     0.950000       345226        20.00
       2.747     0.956250       347476        22.86
       2.801     0.962500       349788        26.67
       2.863     0.968750       352042        32.00
       2.895     0.971875       353140        35.56
       2.933     0.975000       354257        40.00
       2.979     0.978125       355429        45.71
       3.027     0.981250       356572        53.33
       3.079     0.984375       357676        64.00
       3.109     0.985938       358260        71.11
       3.137     0.987500       358801        80.00
       3.165     0.989062       359380        91.43
       3.199     0.990625       359941       106.67
       3.233     0.992188       360521       128.00
       3.253     0.992969       360801       142.22
       3.273     0.993750       361103       160.00
       3.293     0.994531       361364       182.86
       3.325     0.995313       361646       213.33
       3.361     0.996094       361920       256.00
       3.389     0.996484       362066       284.44
       3.425     0.996875       362204       320.00
       3.465     0.997266       362348       365.71
       3.517     0.997656       362489       426.67
       3.589     0.998047       362634       512.00
       3.619     0.998242       362703       568.89
       3.657     0.998437       362774       640.00
       3.697     0.998633       362844       731.43
       3.751     0.998828       362915       853.33
       3.805     0.999023       362985      1024.00
       3.837     0.999121       363020      1137.78
       3.865     0.999219       363056      1280.00
       3.907     0.999316       363092      1462.86
       3.971     0.999414       363127      1706.67
       4.057     0.999512       363162      2048.00
       4.083     0.999561       363180      2275.56
       4.119     0.999609       363198      2560.00
       4.171     0.999658       363216      2925.71
       4.199     0.999707       363233      3413.33
       4.251     0.999756       363251      4096.00
       4.267     0.999780       363260      4551.11
       4.323     0.999805       363270      5120.00
       4.347     0.999829       363278      5851.43
       4.383     0.999854       363286      6826.67
       4.455     0.999878       363295      8192.00
       4.507     0.999890       363300      9102.22
       4.523     0.999902       363304     10240.00
       4.575     0.999915       363308     11702.86
       4.607     0.999927       363314     13653.33
       4.631     0.999939       363317     16384.00
       4.687     0.999945       363320     18204.44
       4.735     0.999951       363322     20480.00
       4.775     0.999957       363325     23405.71
       4.875     0.999963       363326     27306.67
       5.071     0.999969       363328     32768.00
       5.243     0.999973       363330     36408.89
       5.247     0.999976       363331     40960.00
       5.267     0.999979       363332     46811.43
       5.343     0.999982       363333     54613.33
       5.415     0.999985       363334     65536.00
       5.419     0.999986       363335     72817.78
       5.419     0.999988       363335     81920.00
       5.475     0.999989       363336     93622.86
       5.475     0.999991       363336    109226.67
       5.727     0.999992       363337    131072.00
       5.727     0.999993       363337    145635.56
       5.727     0.999994       363337    163840.00
       5.867     0.999995       363338    187245.71
       5.867     0.999995       363338    218453.33
       5.867     0.999996       363338    262144.00
       5.867     0.999997       363338    291271.11
       5.867     0.999997       363338    327680.00
       5.927     0.999997       363339    374491.43
       5.927     1.000000       363339          inf
#[Mean    =        1.464, StdDeviation   =        0.666]
#[Max     =        5.924, Total count    =       363339]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  363351 requests in 10.00s, 45.05MB read
Requests/sec:  36334.90
Transfer/sec:      4.50MB