benchmark/results/v0.7/baseline-pre-v0.7/RAW/go_nethttp-plaintext-throughput-cal-37850.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  1 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.47ms  678.96us   6.11ms   67.75%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    1.86ms
 90.000%    2.43ms
 99.000%    3.29ms
 99.900%    3.93ms
 99.990%    4.86ms
 99.999%    5.76ms
100.000%    6.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.046     0.000000            1         1.00
       0.640     0.100000        37256         1.11
       0.877     0.200000        74641         1.25
       1.070     0.300000       111764         1.43
       1.239     0.400000       149174         1.67
       1.395     0.500000       186331         2.00
       1.472     0.550000       205082         2.22
       1.554     0.600000       223630         2.50
       1.645     0.650000       242221         2.86
       1.743     0.700000       260895         3.33
       1.856     0.750000       279411         4.00
       1.922     0.775000       288715         4.44
       1.999     0.800000       298040         5.00
       2.095     0.825000       307414         5.71
       2.197     0.850000       316669         6.67
       2.305     0.875000       326102         8.00
       2.363     0.887500       330727         8.89
       2.427     0.900000       335368        10.00
       2.495     0.912500       339897        11.43
       2.573     0.925000       344638        13.33
       2.655     0.937500       349220        16.00
       2.701     0.943750       351617        17.78
       2.747     0.950000       353945        20.00
       2.801     0.956250       356210        22.86
       2.865     0.962500       358573        26.67
       2.941     0.968750       360876        32.00
       2.983     0.971875       362028        35.56
       3.033     0.975000       363210        40.00
       3.081     0.978125       364365        45.71
       3.129     0.981250       365526        53.33
       3.179     0.984375       366668        64.00
       3.209     0.985938       367268        71.11
       3.241     0.987500       367873        80.00
       3.269     0.989062       368415        91.43
       3.305     0.990625       369001       106.67
       3.345     0.992188       369581       128.00
       3.373     0.992969       369887       142.22
       3.407     0.993750       370165       160.00
       3.449     0.994531       370452       182.86
       3.499     0.995313       370744       213.33
       3.553     0.996094       371038       256.00
       3.585     0.996484       371186       284.44
       3.615     0.996875       371333       320.00
       3.647     0.997266       371469       365.71
       3.685     0.997656       371619       426.67
       3.733     0.998047       371765       512.00
       3.761     0.998242       371836       568.89
       3.797     0.998437       371905       640.00
       3.839     0.998633       371984       731.43
       3.879     0.998828       372054       853.33
       3.941     0.999023       372124      1024.00
       3.975     0.999121       372161      1137.78
       4.015     0.999219       372197      1280.00
       4.071     0.999316       372233      1462.86
       4.115     0.999414       372270      1706.67
       4.163     0.999512       372306      2048.00
       4.199     0.999561       372324      2275.56
       4.239     0.999609       372343      2560.00
       4.295     0.999658       372360      2925.71
       4.383     0.999707       372378      3413.33
       4.499     0.999756       372397      4096.00
       4.559     0.999780       372406      4551.11
       4.615     0.999805       372415      5120.00
       4.671     0.999829       372424      5851.43
       4.727     0.999854       372433      6826.67
       4.827     0.999878       372442      8192.00
       4.847     0.999890       372447      9102.22
       4.863     0.999902       372451     10240.00
       4.975     0.999915       372456     11702.86
       5.067     0.999927       372460     13653.33
       5.259     0.999939       372465     16384.00
       5.303     0.999945       372467     18204.44
       5.351     0.999951       372470     20480.00
       5.355     0.999957       372472     23405.71
       5.367     0.999963       372474     27306.67
       5.415     0.999969       372477     32768.00
       5.415     0.999973       372477     36408.89
       5.455     0.999976       372478     40960.00
       5.535     0.999979       372480     46811.43
       5.655     0.999982       372481     54613.33
       5.659     0.999985       372482     65536.00
       5.659     0.999986       372482     72817.78
       5.759     0.999988       372483     81920.00
       5.771     0.999989       372484     93622.86
       5.771     0.999991       372484    109226.67
       5.867     0.999992       372485    131072.00
       5.867     0.999993       372485    145635.56
       5.867     0.999994       372485    163840.00
       5.903     0.999995       372486    187245.71
       5.903     0.999995       372486    218453.33
       5.903     0.999996       372486    262144.00
       5.903     0.999997       372486    291271.11
       5.903     0.999997       372486    327680.00
       6.115     0.999997       372487    374491.43
       6.115     1.000000       372487          inf
#[Mean    =        1.471, StdDeviation   =        0.679]
#[Max     =        6.112, Total count    =       372487]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  372488 requests in 10.00s, 46.18MB read
Requests/sec:  37248.72
Transfer/sec:      4.62MB